---
kind: property
id: P:Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs.FocusGained
source: html/27545c3b-a9ff-aa69-88ea-a0cd831c61be.htm
---
# Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs.FocusGained Property

True if the pane is being activated, false if it is being inactivated.

## Syntax (C#)
```csharp
public bool FocusGained { get; }
```